In [2]:
import sqlite3 as lite

#### 0301_Lab     
Write a Python script using which  
1. Create a database named `0301_Students.sqlite` in your folders.    
2. CREATE a table named `Students` in the database   
    students(name TEXT, USN TEXT, email TEXT, primary key(USN) )   
3. Insert four records in the table.      
4. Commit the changes.  
5. Test by reading the rows.

In [3]:
con = lite.connect('0301_Students.sqlite')

In [4]:
cur = con.cursor()

In [15]:
create_cmd = '''
CREATE TABLE IF NOT EXISTS Students 
(
    Name VARCHAR NOT NULL,
    USN VARCHAR PRIMARY KEY,
    Email VARCHAR NOT NULL,
    Linux CHAR(1) CHECK (Linux in ('Y','N'))
)
'''
cur.execute(create_cmd)

In [17]:
list_values = [
    ['Ubuntu', '1RVU22CSE007', 'ubuntu22@rvu.edu.in', 'Y'],
    ['Fedora', '1RVU22CSE134', 'fedora23@rvu.edu.in', 'Y'],
    ['Windows XP', '1RVU22CSE332', 'windowsxp@rvu.edu.in', 'N'],
    ['MacOS Mojave', '1RVU22CSE110', 'macosmojave@rvu.edu.in', 'Y']
]

cur.executemany('INSERT INTO Students VALUES (?,?,?,?)', list_values)

In [18]:
con.commit()

In [19]:
cur.execute("SELECT * FROM Students").fetchall()

[('Ubuntu', '1RVU22CSE007', 'ubuntu22@rvu.edu.in', 'Y'),
 ('Fedora', '1RVU22CSE134', 'fedora23@rvu.edu.in', 'Y'),
 ('Windows XP', '1RVU22CSE332', 'windowsxp@rvu.edu.in', 'N'),
 ('MacOS Mojave', '1RVU22CSE110', 'macosmojave@rvu.edu.in', 'Y')]

6. Update the table replacing the RVU email ID with your private email ID.  
7. Read and display all the data from sqlite_master  
8. Read and display table_info using PRAGMA

In [20]:
update_cmd = f'''
UPDATE STUDENTS 
SET EMAIL = 'ubuntu@ubuntu.com'
WHERE NAME LIKE 'Ubuntu'
'''

cur.execute(update_cmd)

In [21]:
con.commit()

In [22]:
cur.execute("SELECT * FROM Students").fetchall()

[('Ubuntu', '1RVU22CSE007', 'ubuntu@ubuntu.com', 'Y'),
 ('Fedora', '1RVU22CSE134', 'fedora23@rvu.edu.in', 'Y'),
 ('Windows XP', '1RVU22CSE332', 'windowsxp@rvu.edu.in', 'N'),
 ('MacOS Mojave', '1RVU22CSE110', 'macosmojave@rvu.edu.in', 'Y')]

In [1]:
import pandas as pd

In [7]:
pd.read_sql("SELECT * FROM sqlite_master", con)

,type,name,tbl_name,rootpage,sql
0,table,Students,Students,2,CREATE TABLE Students \n(\n Name VARCHAR NO...

In [16]:
pd.read_sql("PRAGMA TABLE_INFO (Students)", con)

   cid   name     type  notnull dflt_value  pk
0    0   Name  VARCHAR        1       None   0
1    1    USN  VARCHAR        0       None   1
2    2  Email  VARCHAR        1       None   0
3    3  Linux  CHAR(1)        0       None   0

9. For the tables below, create ERD diagram, export it as `0301_ERD.svg` and save in your folder.

```
CREATE TABLE Scores(
               FUSN Text,
               course_ID Integer, 
               FOREIGN KEY(FUSN) REFERENCES Student(FUSN), 
               FOREIGN KEY(course_ID) REFERENCES Course(course_ID), 
               Score Int, 
               Primary Key(FUSN, course_ID) 
              );
```